Z9Kent/hal_atmel/include/dt-bindings/pinctrl/saml22n-pinctrl.h
/* pa15h_gclk_io1 */
#define PA15H_GCLK_IO1 \
	SAM_PINMUX(a, 15, h, periph)

/* pa16_gpio */
#define PA16_GPIO \
	SAM_PINMUX(a, 16, gpio, gpio)

/* pa16a_eic_extint0 */
#define PA16A_EIC_EXTINT0 \
	SAM_PINMUX(a, 16, a, periph)

/* pa16c_sercom1_pad0 */
#define PA16C_SERCOM1_PAD0 \
	SAM_PINMUX(a, 16, c, periph)

/* pa16d_sercom2_pad0 */
#define PA16D_SERCOM2_PAD0 \
	SAM_PINMUX(a, 16, d, periph)

/* pa16f_tcc0_wo6 */
#define PA16F_TCC0_WO6 \
	SAM_PINMUX(a, 16, f, periph)

/* pa16h_gclk_io2 */
#define PA16H_GCLK_IO2 \
	SAM_PINMUX(a, 16, h, periph)

/* pa17_gpio */
#define PA17_GPIO \
	SAM_PINMUX(a, 17, gpio, gpio)

/* pa17a_eic_extint1 */
#define PA17A_EIC_EXTINT1 \
	SAM_PINMUX(a, 17, a, periph)

/* pa17c_sercom1_pad1 */
#define PA17C_SERCOM1_PAD1 \
	SAM_PINMUX(a, 17, c, periph)

/* pa17d_sercom2_pad1 */
#define PA17D_SERCOM2_PAD1 \
	SAM_PINMUX(a, 17, d, periph)

/* pa17f_tcc0_wo7 */
#define PA17F_TCC0_WO7 \
	SAM_PINMUX(a, 17, f, periph)

/* pa17h_gclk_io3 */
#define PA17H_GCLK_IO3 \
	SAM_PINMUX(a, 17, h, periph)

/* pa18_gpio */
#define PA18_GPIO \
	SAM_PINMUX(a, 18, gpio, gpio)

/* pa18a_eic_extint2 */
#define PA18A_EIC_EXTINT2 \
	SAM_PINMUX(a, 18, a, periph)

/* pa18c_sercom1_pad2 */
#define PA18C_SERCOM1_PAD2 \
	SAM_PINMUX(a, 18, c, periph)

/* pa18d_sercom2_pad2 */
#define PA18D_SERCOM2_PAD2 \
	SAM_PINMUX(a, 18, d, periph)

/* pa18f_tcc0_wo2 */
#define PA18F_TCC0_WO2 \
	SAM_PINMUX(a, 18, f, periph)

/* pa19_gpio */
#define PA19_GPIO \
	SAM_PINMUX(a, 19, gpio, gpio)

/* pa19a_eic_extint13 */
#define PA19A_EIC_EXTINT13 \
	SAM_PINMUX(a, 19, a, periph)

/* pa19c_sercom1_pad3 */
#define PA19C_SERCOM1_PAD3 \
	SAM_PINMUX(a, 19, c, periph)

/* pa19d_sercom2_pad3 */
#define PA19D_SERCOM2_PAD3 \
	SAM_PINMUX(a, 19, d, periph)

/* pa19f_tcc0_wo3 */
#define PA19F_TCC0_WO3 \
	SAM_PINMUX(a, 19, f, periph)

/* pa20_gpio */
#define PA20_GPIO \
	SAM_PINMUX(a, 20, gpio, gpio)

/* pa20a_eic_extint4 */
#define PA20A_EIC_EXTINT4 \
	SAM_PINMUX(a, 20, a, periph)

/* pa20c_sercom0_pad0 */
#define PA20C_SERCOM0_PAD0 \
	SAM_PINMUX(a, 20, c, periph)

/* pa20d_sercom2_pad2 */
#define PA20D_SERCOM2_PAD2 \
	SAM_PINMUX(a, 20, d, periph)

/* pa20e_tc3_wo0 */
#define PA20E_TC3_WO0 \
	SAM_PINMUX(a, 20, e, periph)

/* pa20f_tcc0_wo6 */
#define PA20F_TCC0_WO6 \
	SAM_PINMUX(a, 20, f, periph)

/* pa20h_gclk_io4 */
#define PA20H_GCLK_IO4 \
	SAM_PINMUX(a, 20, h, periph)

/* pa21_gpio */
#define PA21_GPIO \
	SAM_PINMUX(a, 21, gpio, gpio)

/* pa21a_eic_extint5 */
#define PA21A_EIC_EXTINT5 \
	SAM_PINMUX(a, 21, a, periph)

/* pa21c_sercom0_pad1 */
#define PA21C_SERCOM0_PAD1 \
	SAM_PINMUX(a, 21, c, periph)

/* pa21d_sercom2_pad3 */
#define PA21D_SERCOM2_PAD3 \
	SAM_PINMUX(a, 21, d, periph)

/* pa21e_tc3_wo1 */
#define PA21E_TC3_WO1 \
	SAM_PINMUX(a, 21, e, periph)

/* pa21f_tcc0_wo7 */
#define PA21F_TCC0_WO7 \
	SAM_PINMUX(a, 21, f, periph)

/* pa22_gpio */
#define PA22_GPIO \
	SAM_PINMUX(a, 22, gpio, gpio)

/* pa22a_eic_extint6 */
#define PA22A_EIC_EXTINT6 \
	SAM_PINMUX(a, 22, a, periph)

/* pa22c_sercom0_pad2 */
#define PA22C_SERCOM0_PAD2 \
	SAM_PINMUX(a, 22, c, periph)

/* pa22d_sercom2_pad0 */
#define PA22D_SERCOM2_PAD0 \
	SAM_PINMUX(a, 22, d, periph)

/* pa22e_tc0_wo0 */
#define PA22E_TC0_WO0 \
	SAM_PINMUX(a, 22, e, periph)

/* pa22f_tcc0_wo4 */
#define PA22F_TCC0_WO4 \
	SAM_PINMUX(a, 22, f, periph)

/* pa23_gpio */
#define PA23_GPIO \
	SAM_PINMUX(a, 23, gpio, gpio)

/* pa23a_eic_extint7 */
#define PA23A_EIC_EXTINT7 \
	SAM_PINMUX(a, 23, a, periph)

/* pa23c_sercom0_pad3 */
#define PA23C_SERCOM0_PAD3 \
	SAM_PINMUX(a, 23, c, periph)

/* pa23d_sercom2_pad1 */
#define PA23D_SERCOM2_PAD1 \
	SAM_PINMUX(a, 23, d, periph)

/* pa23e_tc0_wo1 */
#define PA23E_TC0_WO1 \
	SAM_PINMUX(a, 23, e, periph)

/* pa23f_tcc0_wo5 */
#define PA23F_TCC0_WO5 \
	SAM_PINMUX(a, 23, f, periph)

/* pa23g_usb_sof */
#define PA23G_USB_SOF \
	SAM_PINMUX(a, 23, g, periph)

/* pa24_gpio */
#define PA24_GPIO \
	SAM_PINMUX(a, 24, gpio, gpio)

/* pa24a_eic_extint12 */
#define PA24A_EIC_EXTINT12 \
	SAM_PINMUX(a, 24, a, periph)

/* pa24c_sercom2_pad2 */
#define PA24C_SERCOM2_PAD2 \
	SAM_PINMUX(a, 24, c, periph)

/* pa24d_sercom5_pad0 */
#define PA24D_SERCOM5_PAD0 \
	SAM_PINMUX(a, 24, d, periph)

/* pa24e_tc1_wo1 */
#define PA24E_TC1_WO1 \
	SAM_PINMUX(a, 24, e, periph)

/* pa24f_tcc0_wo1 */
#define PA24F_TCC0_WO1 \
	SAM_PINMUX(a, 24, f, periph)

/* pa24g_usb_dm */
#define PA24G_USB_DM \
	SAM_PINMUX(a, 24, g, periph)

/* pa25_gpio */
#define PA25_GPIO \
	SAM_PINMUX(a, 25, gpio, gpio)

/* pa25a_eic_extint13 */
#define PA25A_EIC_EXTINT13 \
	SAM_PINMUX(a, 25, a, periph)

/* pa25c_sercom2_pad3 */
#define PA25C_SERCOM2_PAD3 \
	SAM_PINMUX(a, 25, c, periph)

/* pa25d_sercom5_pad1 */
#define PA25D_SERCOM5_PAD1 \
	SAM_PINMUX(a, 25, d, periph)

/* pa25e_tc1_wo1 */
#define PA25E_TC1_WO1 \
	SAM_PINMUX(a, 25, e, periph)

/* pa25f_tcc0_wo1 */
#define PA25F_TCC0_WO1 \
	SAM_PINMUX(a, 25, f, periph)

/* pa25g_usb_dp */
#define PA25G_USB_DP \
	SAM_PINMUX(a, 25, g, periph)

/* pa27_gpio */
#define PA27_GPIO \
	SAM_PINMUX(a, 27, gpio, gpio)

/* pa27a_eic_extint15 */
#define PA27A_EIC_EXTINT15 \
	SAM_PINMUX(a, 27, a, periph)

/* pa27f_tcc0_wo5 */
#define PA27F_TCC0_WO5 \
	SAM_PINMUX(a, 27, f, periph)

/* pa27h_gclk_io4 */
#define PA27H_GCLK_IO4 \
	SAM_PINMUX(a, 27, h, periph)

/* pa30_gpio */
#define PA30_GPIO \
	SAM_PINMUX(a, 30, gpio, gpio)

/* pa30a_eic_extint10 */
#define PA30A_EIC_EXTINT10 \
	SAM_PINMUX(a, 30, a, periph)

/* pa30d_sercom1_pad2 */
#define PA30D_SERCOM1_PAD2 \
	SAM_PINMUX(a, 30, d, periph)

/* pa30h_gclk_io4 */
#define PA30H_GCLK_IO4 \
	SAM_PINMUX(a, 30, h, periph)

/* pa31_gpio */
#define PA31_GPIO \
	SAM_PINMUX(a, 31, gpio, gpio)

/* pa31a_eic_extint11 */
#define PA31A_EIC_EXTINT11 \
	SAM_PINMUX(a, 31, a, periph)

/* pa31d_sercom1_pad3 */
#define PA31D_SERCOM1_PAD3 \
	SAM_PINMUX(a, 31, d, periph)

/* pb0_gpio */
#define PB0_GPIO \
	SAM_PINMUX(b, 0, gpio, gpio)

/* pb0a_eic_extint0 */
#define PB0A_EIC_EXTINT0 \
	SAM_PINMUX(b, 0, a, periph)

/* pb0b_adc_ain8 */
#define PB0B_ADC_AIN8 \
	SAM_PINMUX(b, 0, b, periph)

/* pb0c_sercom3_pad2 */
#define PB0C_SERCOM3_PAD2 \
	SAM_PINMUX(b, 0, c, periph)

