Z9Kent/hal_atmel/include/dt-bindings/pinctrl/saml22n-pinctrl.h
/* pb0d_sercom5_pad2 */
#define PB0D_SERCOM5_PAD2 \
	SAM_PINMUX(b, 0, d, periph)

/* pb0e_tc3_wo0 */
#define PB0E_TC3_WO0 \
	SAM_PINMUX(b, 0, e, periph)

/* pb1_gpio */
#define PB1_GPIO \
	SAM_PINMUX(b, 1, gpio, gpio)

/* pb1a_eic_extint1 */
#define PB1A_EIC_EXTINT1 \
	SAM_PINMUX(b, 1, a, periph)

/* pb1b_adc_ain9 */
#define PB1B_ADC_AIN9 \
	SAM_PINMUX(b, 1, b, periph)

/* pb1c_sercom3_pad3 */
#define PB1C_SERCOM3_PAD3 \
	SAM_PINMUX(b, 1, c, periph)

/* pb1d_sercom5_pad3 */
#define PB1D_SERCOM5_PAD3 \
	SAM_PINMUX(b, 1, d, periph)

/* pb1e_tc3_wo1 */
#define PB1E_TC3_WO1 \
	SAM_PINMUX(b, 1, e, periph)

/* pb2_gpio */
#define PB2_GPIO \
	SAM_PINMUX(b, 2, gpio, gpio)

/* pb2a_eic_extint2 */
#define PB2A_EIC_EXTINT2 \
	SAM_PINMUX(b, 2, a, periph)

/* pb2b_adc_ain10 */
#define PB2B_ADC_AIN10 \
	SAM_PINMUX(b, 2, b, periph)

/* pb2c_sercom3_pad0 */
#define PB2C_SERCOM3_PAD0 \
	SAM_PINMUX(b, 2, c, periph)

/* pb2d_sercom5_pad0 */
#define PB2D_SERCOM5_PAD0 \
	SAM_PINMUX(b, 2, d, periph)

/* pb2e_tc2_wo0 */
#define PB2E_TC2_WO0 \
	SAM_PINMUX(b, 2, e, periph)

/* pb3_gpio */
#define PB3_GPIO \
	SAM_PINMUX(b, 3, gpio, gpio)

/* pb3a_eic_extint3 */
#define PB3A_EIC_EXTINT3 \
	SAM_PINMUX(b, 3, a, periph)

/* pb3b_adc_ain11 */
#define PB3B_ADC_AIN11 \
	SAM_PINMUX(b, 3, b, periph)

/* pb3c_sercom3_pad1 */
#define PB3C_SERCOM3_PAD1 \
	SAM_PINMUX(b, 3, c, periph)

/* pb3d_sercom5_pad1 */
#define PB3D_SERCOM5_PAD1 \
	SAM_PINMUX(b, 3, d, periph)

/* pb3e_tc2_wo1 */
#define PB3E_TC2_WO1 \
	SAM_PINMUX(b, 3, e, periph)

/* pb4_gpio */
#define PB4_GPIO \
	SAM_PINMUX(b, 4, gpio, gpio)

/* pb4a_eic_extint4 */
#define PB4A_EIC_EXTINT4 \
	SAM_PINMUX(b, 4, a, periph)

/* pb4b_adc_ain12 */
#define PB4B_ADC_AIN12 \
	SAM_PINMUX(b, 4, b, periph)

/* pb4b_ptc_xy10 */
#define PB4B_PTC_XY10 \
	SAM_PINMUX(b, 4, b, periph)

/* pb5_gpio */
#define PB5_GPIO \
	SAM_PINMUX(b, 5, gpio, gpio)

/* pb5a_eic_extint5 */
#define PB5A_EIC_EXTINT5 \
	SAM_PINMUX(b, 5, a, periph)

/* pb5b_adc_ain13 */
#define PB5B_ADC_AIN13 \
	SAM_PINMUX(b, 5, b, periph)

/* pb5b_ptc_xy11 */
#define PB5B_PTC_XY11 \
	SAM_PINMUX(b, 5, b, periph)

/* pb6_gpio */
#define PB6_GPIO \
	SAM_PINMUX(b, 6, gpio, gpio)

/* pb6a_eic_extint6 */
#define PB6A_EIC_EXTINT6 \
	SAM_PINMUX(b, 6, a, periph)

/* pb6b_adc_ain14 */
#define PB6B_ADC_AIN14 \
	SAM_PINMUX(b, 6, b, periph)

/* pb6b_ptc_xy12 */
#define PB6B_PTC_XY12 \
	SAM_PINMUX(b, 6, b, periph)

/* pb7_gpio */
#define PB7_GPIO \
	SAM_PINMUX(b, 7, gpio, gpio)

/* pb7a_eic_extint7 */
#define PB7A_EIC_EXTINT7 \
	SAM_PINMUX(b, 7, a, periph)

/* pb7b_adc_ain15 */
#define PB7B_ADC_AIN15 \
	SAM_PINMUX(b, 7, b, periph)

/* pb7b_ptc_xy13 */
#define PB7B_PTC_XY13 \
	SAM_PINMUX(b, 7, b, periph)

/* pb8_gpio */
#define PB8_GPIO \
	SAM_PINMUX(b, 8, gpio, gpio)

/* pb8a_eic_extint8 */
#define PB8A_EIC_EXTINT8 \
	SAM_PINMUX(b, 8, a, periph)

/* pb8b_adc_ain2 */
#define PB8B_ADC_AIN2 \
	SAM_PINMUX(b, 8, b, periph)

/* pb8b_ptc_xy14 */
#define PB8B_PTC_XY14 \
	SAM_PINMUX(b, 8, b, periph)

/* pb8d_sercom3_pad0 */
#define PB8D_SERCOM3_PAD0 \
	SAM_PINMUX(b, 8, d, periph)

/* pb8e_tc0_wo0 */
#define PB8E_TC0_WO0 \
	SAM_PINMUX(b, 8, e, periph)

/* pb9_gpio */
#define PB9_GPIO \
	SAM_PINMUX(b, 9, gpio, gpio)

/* pb9a_eic_extint9 */
#define PB9A_EIC_EXTINT9 \
	SAM_PINMUX(b, 9, a, periph)

/* pb9b_adc_ain3 */
#define PB9B_ADC_AIN3 \
	SAM_PINMUX(b, 9, b, periph)

/* pb9b_ptc_xy15 */
#define PB9B_PTC_XY15 \
	SAM_PINMUX(b, 9, b, periph)

/* pb9d_sercom3_pad1 */
#define PB9D_SERCOM3_PAD1 \
	SAM_PINMUX(b, 9, d, periph)

/* pb9e_tc0_wo1 */
#define PB9E_TC0_WO1 \
	SAM_PINMUX(b, 9, e, periph)

/* pb11_gpio */
#define PB11_GPIO \
	SAM_PINMUX(b, 11, gpio, gpio)

/* pb11a_eic_extint11 */
#define PB11A_EIC_EXTINT11 \
	SAM_PINMUX(b, 11, a, periph)

/* pb11d_sercom3_pad3 */
#define PB11D_SERCOM3_PAD3 \
	SAM_PINMUX(b, 11, d, periph)

/* pb11e_tc1_wo1 */
#define PB11E_TC1_WO1 \
	SAM_PINMUX(b, 11, e, periph)

/* pb11f_tcc0_wo5 */
#define PB11F_TCC0_WO5 \
	SAM_PINMUX(b, 11, f, periph)

/* pb12_gpio */
#define PB12_GPIO \
	SAM_PINMUX(b, 12, gpio, gpio)

/* pb12a_eic_extint12 */
#define PB12A_EIC_EXTINT12 \
	SAM_PINMUX(b, 12, a, periph)

/* pb12c_sercom3_pad0 */
#define PB12C_SERCOM3_PAD0 \
	SAM_PINMUX(b, 12, c, periph)

/* pb12e_tc0_wo0 */
#define PB12E_TC0_WO0 \
	SAM_PINMUX(b, 12, e, periph)

/* pb12f_tcc0_wo6 */
#define PB12F_TCC0_WO6 \
	SAM_PINMUX(b, 12, f, periph)

/* pb13_gpio */
#define PB13_GPIO \
	SAM_PINMUX(b, 13, gpio, gpio)

/* pb13a_eic_extint13 */
#define PB13A_EIC_EXTINT13 \
	SAM_PINMUX(b, 13, a, periph)

/* pb13c_sercom3_pad1 */
#define PB13C_SERCOM3_PAD1 \
	SAM_PINMUX(b, 13, c, periph)

/* pb13e_tc0_wo1 */
#define PB13E_TC0_WO1 \
	SAM_PINMUX(b, 13, e, periph)

/* pb13f_tcc0_wo7 */
#define PB13F_TCC0_WO7 \
	SAM_PINMUX(b, 13, f, periph)

/* pb14_gpio */
#define PB14_GPIO \
	SAM_PINMUX(b, 14, gpio, gpio)

/* pb14a_eic_extint14 */
#define PB14A_EIC_EXTINT14 \
	SAM_PINMUX(b, 14, a, periph)

/* pb14c_sercom3_pad2 */
#define PB14C_SERCOM3_PAD2 \
	SAM_PINMUX(b, 14, c, periph)

/* pb14e_tc1_wo0 */
#define PB14E_TC1_WO0 \
	SAM_PINMUX(b, 14, e, periph)

/* pb14h_gclk_io0 */
#define PB14H_GCLK_IO0 \
	SAM_PINMUX(b, 14, h, periph)

/* pb15_gpio */
#define PB15_GPIO \
	SAM_PINMUX(b, 15, gpio, gpio)

/* pb15a_eic_extint15 */
#define PB15A_EIC_EXTINT15 \
	SAM_PINMUX(b, 15, a, periph)

/* pb15c_sercom3_pad3 */
#define PB15C_SERCOM3_PAD3 \
	SAM_PINMUX(b, 15, c, periph)

/* pb15e_tc1_wo1 */
#define PB15E_TC1_WO1 \
	SAM_PINMUX(b, 15, e, periph)

/* pb15h_gclk_io1 */
#define PB15H_GCLK_IO1 \
	SAM_PINMUX(b, 15, h, periph)

/* pb16_gpio */
#define PB16_GPIO \
	SAM_PINMUX(b, 16, gpio, gpio)

/* pb16a_eic_extint0 */
#define PB16A_EIC_EXTINT0 \
	SAM_PINMUX(b, 16, a, periph)

/* pb16c_sercom5_pad0 */
#define PB16C_SERCOM5_PAD0 \
	SAM_PINMUX(b, 16, c, periph)

/* pb16e_tc2_wo0 */
#define PB16E_TC2_WO0 \
	SAM_PINMUX(b, 16, e, periph)

/* pb16f_tcc0_wo4 */
#define PB16F_TCC0_WO4 \
	SAM_PINMUX(b, 16, f, periph)

/* pb16h_gclk_io2 */
#define PB16H_GCLK_IO2 \
	SAM_PINMUX(b, 16, h, periph)

/* pb17_gpio */
#define PB17_GPIO \
	SAM_PINMUX(b, 17, gpio, gpio)

/* pb17a_eic_extint1 */
#define PB17A_EIC_EXTINT1 \
	SAM_PINMUX(b, 17, a, periph)

/* pb17c_sercom5_pad1 */
#define PB17C_SERCOM5_PAD1 \
	SAM_PINMUX(b, 17, c, periph)

/* pb17e_tc2_wo1 */
#define PB17E_TC2_WO1 \
	SAM_PINMUX(b, 17, e, periph)

