Z9Kent/hal_atmel/include/dt-bindings/pinctrl/saml22n-pinctrl.h
/* pb17f_tcc0_wo5 */
#define PB17F_TCC0_WO5 \
	SAM_PINMUX(b, 17, f, periph)

/* pb17h_gclk_io3 */
#define PB17H_GCLK_IO3 \
	SAM_PINMUX(b, 17, h, periph)

/* pb18_gpio */
#define PB18_GPIO \
	SAM_PINMUX(b, 18, gpio, gpio)

/* pb18a_eic_extint2 */
#define PB18A_EIC_EXTINT2 \
	SAM_PINMUX(b, 18, a, periph)

/* pb18c_sercom5_pad2 */
#define PB18C_SERCOM5_PAD2 \
	SAM_PINMUX(b, 18, c, periph)

/* pb18d_sercom3_pad2 */
#define PB18D_SERCOM3_PAD2 \
	SAM_PINMUX(b, 18, d, periph)

/* pb18f_tcc0_wo0 */
#define PB18F_TCC0_WO0 \
	SAM_PINMUX(b, 18, f, periph)

/* pb19_gpio */
#define PB19_GPIO \
	SAM_PINMUX(b, 19, gpio, gpio)

/* pb19a_eic_extint3 */
#define PB19A_EIC_EXTINT3 \
	SAM_PINMUX(b, 19, a, periph)

/* pb19c_sercom5_pad3 */
#define PB19C_SERCOM5_PAD3 \
	SAM_PINMUX(b, 19, c, periph)

/* pb19d_sercom3_pad3 */
#define PB19D_SERCOM3_PAD3 \
	SAM_PINMUX(b, 19, d, periph)

/* pb19f_tcc0_wo1 */
#define PB19F_TCC0_WO1 \
	SAM_PINMUX(b, 19, f, periph)

/* pb20_gpio */
#define PB20_GPIO \
	SAM_PINMUX(b, 20, gpio, gpio)

/* pb20a_eic_extint4 */
#define PB20A_EIC_EXTINT4 \
	SAM_PINMUX(b, 20, a, periph)

/* pb20c_sercom5_pad0 */
#define PB20C_SERCOM5_PAD0 \
	SAM_PINMUX(b, 20, c, periph)

/* pb20d_sercom3_pad0 */
#define PB20D_SERCOM3_PAD0 \
	SAM_PINMUX(b, 20, d, periph)

/* pb20f_tcc0_wo2 */
#define PB20F_TCC0_WO2 \
	SAM_PINMUX(b, 20, f, periph)

/* pb21_gpio */
#define PB21_GPIO \
	SAM_PINMUX(b, 21, gpio, gpio)

/* pb21a_eic_extint5 */
#define PB21A_EIC_EXTINT5 \
	SAM_PINMUX(b, 21, a, periph)

/* pb21c_sercom5_pad1 */
#define PB21C_SERCOM5_PAD1 \
	SAM_PINMUX(b, 21, c, periph)

/* pb21d_sercom3_pad1 */
#define PB21D_SERCOM3_PAD1 \
	SAM_PINMUX(b, 21, d, periph)

/* pb21f_tcc0_wo3 */
#define PB21F_TCC0_WO3 \
	SAM_PINMUX(b, 21, f, periph)

/* pb22_gpio */
#define PB22_GPIO \
	SAM_PINMUX(b, 22, gpio, gpio)

/* pb22a_eic_extint6 */
#define PB22A_EIC_EXTINT6 \
	SAM_PINMUX(b, 22, a, periph)

/* pb22c_sercom0_pad2 */
#define PB22C_SERCOM0_PAD2 \
	SAM_PINMUX(b, 22, c, periph)

/* pb22d_sercom5_pad2 */
#define PB22D_SERCOM5_PAD2 \
	SAM_PINMUX(b, 22, d, periph)

/* pb22e_tc3_wo0 */
#define PB22E_TC3_WO0 \
	SAM_PINMUX(b, 22, e, periph)

/* pb22f_tcc0_wo2 */
#define PB22F_TCC0_WO2 \
	SAM_PINMUX(b, 22, f, periph)

/* pb22g_usb_sof */
#define PB22G_USB_SOF \
	SAM_PINMUX(b, 22, g, periph)

/* pb22h_gclk_io4 */
#define PB22H_GCLK_IO4 \
	SAM_PINMUX(b, 22, h, periph)

/* pb23_gpio */
#define PB23_GPIO \
	SAM_PINMUX(b, 23, gpio, gpio)

/* pb23a_eic_extint7 */
#define PB23A_EIC_EXTINT7 \
	SAM_PINMUX(b, 23, a, periph)

/* pb23c_sercom0_pad3 */
#define PB23C_SERCOM0_PAD3 \
	SAM_PINMUX(b, 23, c, periph)

/* pb23d_sercom5_pad3 */
#define PB23D_SERCOM5_PAD3 \
	SAM_PINMUX(b, 23, d, periph)

/* pb23e_tc3_wo1 */
#define PB23E_TC3_WO1 \
	SAM_PINMUX(b, 23, e, periph)

/* pb23f_tcc0_wo3 */
#define PB23F_TCC0_WO3 \
	SAM_PINMUX(b, 23, f, periph)

/* pb23h_gclk_io4 */
#define PB23H_GCLK_IO4 \
	SAM_PINMUX(b, 23, h, periph)

/* pb24_gpio */
#define PB24_GPIO \
	SAM_PINMUX(b, 24, gpio, gpio)

/* pb24a_eic_extint8 */
#define PB24A_EIC_EXTINT8 \
	SAM_PINMUX(b, 24, a, periph)

/* pb24c_sercom0_pad0 */
#define PB24C_SERCOM0_PAD0 \
	SAM_PINMUX(b, 24, c, periph)

/* pb24d_sercom5_pad0 */
#define PB24D_SERCOM5_PAD0 \
	SAM_PINMUX(b, 24, d, periph)

/* pb24f_tcc0_wo6 */
#define PB24F_TCC0_WO6 \
	SAM_PINMUX(b, 24, f, periph)

/* pb25_gpio */
#define PB25_GPIO \
	SAM_PINMUX(b, 25, gpio, gpio)

/* pb25a_eic_extint9 */
#define PB25A_EIC_EXTINT9 \
	SAM_PINMUX(b, 25, a, periph)

/* pb25c_sercom0_pad1 */
#define PB25C_SERCOM0_PAD1 \
	SAM_PINMUX(b, 25, c, periph)

/* pb25d_sercom4_pad1 */
#define PB25D_SERCOM4_PAD1 \
	SAM_PINMUX(b, 25, d, periph)

/* pb25f_tcc0_wo7 */
#define PB25F_TCC0_WO7 \
	SAM_PINMUX(b, 25, f, periph)

/* pb30_gpio */
#define PB30_GPIO \
	SAM_PINMUX(b, 30, gpio, gpio)

/* pb30a_eic_extint14 */
#define PB30A_EIC_EXTINT14 \
	SAM_PINMUX(b, 30, a, periph)

/* pb30c_sercom1_pad0 */
#define PB30C_SERCOM1_PAD0 \
	SAM_PINMUX(b, 30, c, periph)

/* pb30d_sercom5_pad0 */
#define PB30D_SERCOM5_PAD0 \
	SAM_PINMUX(b, 30, d, periph)

/* pb30e_tcc0_wo0 */
#define PB30E_TCC0_WO0 \
	SAM_PINMUX(b, 30, e, periph)

/* pb31_gpio */
#define PB31_GPIO \
	SAM_PINMUX(b, 31, gpio, gpio)

/* pb31a_eic_extint15 */
#define PB31A_EIC_EXTINT15 \
	SAM_PINMUX(b, 31, a, periph)

/* pb31c_sercom1_pad1 */
#define PB31C_SERCOM1_PAD1 \
	SAM_PINMUX(b, 31, c, periph)

/* pb31d_sercom5_pad1 */
#define PB31D_SERCOM5_PAD1 \
	SAM_PINMUX(b, 31, d, periph)

/* pb31e_tcc0_wo1 */
#define PB31E_TCC0_WO1 \
	SAM_PINMUX(b, 31, e, periph)

/* pc0_gpio */
#define PC0_GPIO \
	SAM_PINMUX(c, 0, gpio, gpio)

/* pc0a_eic_extint8 */
#define PC0A_EIC_EXTINT8 \
	SAM_PINMUX(c, 0, a, periph)

/* pc0b_adc_ain16 */
#define PC0B_ADC_AIN16 \
	SAM_PINMUX(c, 0, b, periph)

/* pc1_gpio */
#define PC1_GPIO \
	SAM_PINMUX(c, 1, gpio, gpio)

/* pc1a_eic_extintr9 */
#define PC1A_EIC_EXTINTR9 \
	SAM_PINMUX(c, 1, a, periph)

/* pc1b_adc_ain17 */
#define PC1B_ADC_AIN17 \
	SAM_PINMUX(c, 1, b, periph)

/* pc2_gpio */
#define PC2_GPIO \
	SAM_PINMUX(c, 2, gpio, gpio)

/* pc2a_eic_extint10 */
#define PC2A_EIC_EXTINT10 \
	SAM_PINMUX(c, 2, a, periph)

/* pc2b_adc_ain18 */
#define PC2B_ADC_AIN18 \
	SAM_PINMUX(c, 2, b, periph)

/* pc2b_ptc_xy6 */
#define PC2B_PTC_XY6 \
	SAM_PINMUX(c, 2, b, periph)

/* pc3_gpio */
#define PC3_GPIO \
	SAM_PINMUX(c, 3, gpio, gpio)

/* pc3a_eic_extint11 */
#define PC3A_EIC_EXTINT11 \
	SAM_PINMUX(c, 3, a, periph)

/* pc3b_adc_ain19 */
#define PC3B_ADC_AIN19 \
	SAM_PINMUX(c, 3, b, periph)

/* pc3b_ptc_xy7 */
#define PC3B_PTC_XY7 \
	SAM_PINMUX(c, 3, b, periph)

/* pc5_gpio */
#define PC5_GPIO \
	SAM_PINMUX(c, 5, gpio, gpio)

/* pc5a_eic_extint13 */
#define PC5A_EIC_EXTINT13 \
	SAM_PINMUX(c, 5, a, periph)

/* pc5b_ptc_xy4 */
#define PC5B_PTC_XY4 \
	SAM_PINMUX(c, 5, b, periph)

/* pc6_gpio */
#define PC6_GPIO \
	SAM_PINMUX(c, 6, gpio, gpio)

/* pc6a_eic_extint14 */
#define PC6A_EIC_EXTINT14 \
	SAM_PINMUX(c, 6, a, periph)

/* pc6b_ptc_xy5 */
#define PC6B_PTC_XY5 \
	SAM_PINMUX(c, 6, b, periph)

/* pc7_gpio */
#define PC7_GPIO \
	SAM_PINMUX(c, 7, gpio, gpio)

/* pc7a_eic_extint15 */
#define PC7A_EIC_EXTINT15 \
	SAM_PINMUX(c, 7, a, periph)

