Z9Kent/hal_atmel/include/dt-bindings/pinctrl/saml22n-pinctrl.h
/* pc8_gpio */
#define PC8_GPIO \
	SAM_PINMUX(c, 8, gpio, gpio)

/* pc8a_eic_extint0 */
#define PC8A_EIC_EXTINT0 \
	SAM_PINMUX(c, 8, a, periph)

/* pc9_gpio */
#define PC9_GPIO \
	SAM_PINMUX(c, 9, gpio, gpio)

/* pc9a_eic_extint1 */
#define PC9A_EIC_EXTINT1 \
	SAM_PINMUX(c, 9, a, periph)

/* pc10_gpio */
#define PC10_GPIO \
	SAM_PINMUX(c, 10, gpio, gpio)

/* pc10a_eic_extint2 */
#define PC10A_EIC_EXTINT2 \
	SAM_PINMUX(c, 10, a, periph)

/* pc10c_sercom1_pad2 */
#define PC10C_SERCOM1_PAD2 \
	SAM_PINMUX(c, 10, c, periph)

/* pc11_gpio */
#define PC11_GPIO \
	SAM_PINMUX(c, 11, gpio, gpio)

/* pc11a_eic_extint3 */
#define PC11A_EIC_EXTINT3 \
	SAM_PINMUX(c, 11, a, periph)

/* pc11c_sercom1_pad3 */
#define PC11C_SERCOM1_PAD3 \
	SAM_PINMUX(c, 11, c, periph)

/* pc12_gpio */
#define PC12_GPIO \
	SAM_PINMUX(c, 12, gpio, gpio)

/* pc12a_eic_extint4 */
#define PC12A_EIC_EXTINT4 \
	SAM_PINMUX(c, 12, a, periph)

/* pc12c_sercom1_pad0 */
#define PC12C_SERCOM1_PAD0 \
	SAM_PINMUX(c, 12, c, periph)

/* pc13_gpio */
#define PC13_GPIO \
	SAM_PINMUX(c, 13, gpio, gpio)

/* pc13a_eic_extint5 */
#define PC13A_EIC_EXTINT5 \
	SAM_PINMUX(c, 13, a, periph)

/* pc13c_sercom1_pad1 */
#define PC13C_SERCOM1_PAD1 \
	SAM_PINMUX(c, 13, c, periph)

/* pc14_gpio */
#define PC14_GPIO \
	SAM_PINMUX(c, 14, gpio, gpio)

/* pc14a_eic_extint6 */
#define PC14A_EIC_EXTINT6 \
	SAM_PINMUX(c, 14, a, periph)

/* pc15_gpio */
#define PC15_GPIO \
	SAM_PINMUX(c, 15, gpio, gpio)

/* pc15a_eic_extint7 */
#define PC15A_EIC_EXTINT7 \
	SAM_PINMUX(c, 15, a, periph)

/* pc16_gpio */
#define PC16_GPIO \
	SAM_PINMUX(c, 16, gpio, gpio)

/* pc16a_eic_extint8 */
#define PC16A_EIC_EXTINT8 \
	SAM_PINMUX(c, 16, a, periph)

/* pc17_gpio */
#define PC17_GPIO \
	SAM_PINMUX(c, 17, gpio, gpio)

/* pc17a_eic_extint9 */
#define PC17A_EIC_EXTINT9 \
	SAM_PINMUX(c, 17, a, periph)

/* pc18_gpio */
#define PC18_GPIO \
	SAM_PINMUX(c, 18, gpio, gpio)

/* pc18a_eic_extint10 */
#define PC18A_EIC_EXTINT10 \
	SAM_PINMUX(c, 18, a, periph)

/* pc19_gpio */
#define PC19_GPIO \
	SAM_PINMUX(c, 19, gpio, gpio)

/* pc19a_eic_extint11 */
#define PC19A_EIC_EXTINT11 \
	SAM_PINMUX(c, 19, a, periph)

/* pc20_gpio */
#define PC20_GPIO \
	SAM_PINMUX(c, 20, gpio, gpio)

/* pc20a_eic_extint12 */
#define PC20A_EIC_EXTINT12 \
	SAM_PINMUX(c, 20, a, periph)

/* pc21_gpio */
#define PC21_GPIO \
	SAM_PINMUX(c, 21, gpio, gpio)

/* pc21a_eic_extint13 */
#define PC21A_EIC_EXTINT13 \
	SAM_PINMUX(c, 21, a, periph)

/* pc24_gpio */
#define PC24_GPIO \
	SAM_PINMUX(c, 24, gpio, gpio)

/* pc24a_eic_extint0 */
#define PC24A_EIC_EXTINT0 \
	SAM_PINMUX(c, 24, a, periph)

/* pc24c_sercom0_pad2 */
#define PC24C_SERCOM0_PAD2 \
	SAM_PINMUX(c, 24, c, periph)

/* pc24d_sercom4_pad2 */
#define PC24D_SERCOM4_PAD2 \
	SAM_PINMUX(c, 24, d, periph)

/* pc24e_tc2_wo0 */
#define PC24E_TC2_WO0 \
	SAM_PINMUX(c, 24, e, periph)

/* pc24f_tcc0_wo0 */
#define PC24F_TCC0_WO0 \
	SAM_PINMUX(c, 24, f, periph)

/* pc25_gpio */
#define PC25_GPIO \
	SAM_PINMUX(c, 25, gpio, gpio)

/* pc25a_eic_extint1 */
#define PC25A_EIC_EXTINT1 \
	SAM_PINMUX(c, 25, a, periph)

/* pc25c_sercom0_pad3 */
#define PC25C_SERCOM0_PAD3 \
	SAM_PINMUX(c, 25, c, periph)

/* pc25d_sercom4_pad3 */
#define PC25D_SERCOM4_PAD3 \
	SAM_PINMUX(c, 25, d, periph)

/* pc25e_tc2_wo1 */
#define PC25E_TC2_WO1 \
	SAM_PINMUX(c, 25, e, periph)

/* pc25f_tcc0_wo1 */
#define PC25F_TCC0_WO1 \
	SAM_PINMUX(c, 25, f, periph)

/* pc26_gpio */
#define PC26_GPIO \
	SAM_PINMUX(c, 26, gpio, gpio)

/* pc26a_eic_extint2 */
#define PC26A_EIC_EXTINT2 \
	SAM_PINMUX(c, 26, a, periph)

/* pc26e_tc3_wo0 */
#define PC26E_TC3_WO0 \
	SAM_PINMUX(c, 26, e, periph)

/* pc26f_tcc0_wo3 */
#define PC26F_TCC0_WO3 \
	SAM_PINMUX(c, 26, f, periph)

/* pc27_gpio */
#define PC27_GPIO \
	SAM_PINMUX(c, 27, gpio, gpio)

/* pc27a_eic_extint3 */
#define PC27A_EIC_EXTINT3 \
	SAM_PINMUX(c, 27, a, periph)

/* pc27d_sercom1_pad0 */
#define PC27D_SERCOM1_PAD0 \
	SAM_PINMUX(c, 27, d, periph)

/* pc27e_tc3_wo1 */
#define PC27E_TC3_WO1 \
	SAM_PINMUX(c, 27, e, periph)

/* pc27f_tcc0_wo3 */
#define PC27F_TCC0_WO3 \
	SAM_PINMUX(c, 27, f, periph)

/* pc28_gpio */
#define PC28_GPIO \
	SAM_PINMUX(c, 28, gpio, gpio)

/* pc28a_eic_extint4 */
#define PC28A_EIC_EXTINT4 \
	SAM_PINMUX(c, 28, a, periph)

/* pc28d_sercom1_pad1 */
#define PC28D_SERCOM1_PAD1 \
	SAM_PINMUX(c, 28, d, periph)

/* pc28f_tcc0_wo4 */
#define PC28F_TCC0_WO4 \
	SAM_PINMUX(c, 28, f, periph)
